# SharesSettings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..SharesSettings Property
SunAndShadowSettings Class See Also
---
Identifies whether settings are shared globally.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool SharesSettings { get; set; }
```

Visual Basic
---
```text
Public Property SharesSettings As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SharesSettings {
	bool get ();
	void set (bool value);
}
```

# Remarks
Identifies whether the per-view SunAndShadowSettings element shares global settings. Global settings are a special case that allows multiple views to be associated together in order that a change in one view affects that same change in other views. There cannot be multiple such groups, and a SunAndShadowSettings element is either a global setting or not.
# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace